#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.common.data.aci_tenant.common: Reading...
module.common.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.common.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.common.data.aci_tenant.common: Read complete after 1s [id=uni/tn-common]
module.common.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.common.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.git_net_1.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap]
module.common.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.common.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.common.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_1.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_15_bd]
module.git_net_1.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]
module.git_net_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]]
module.git_net_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/subnet-[192.168.15.1/24]]
module.git_net_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/rsdomAtt-[uni/phys-github_project]]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.git_net_1.netbox_ipam_prefix.prefix will be created
  + resource "netbox_ipam_prefix" "prefix" {
      + content_type = (known after apply)
      + id           = (known after apply)
      + prefix       = "192.168.15.0/24"
      + status       = "active"
      + vlan_id      = (known after apply)
    }

  # module.git_net_1.netbox_ipam_vlan.vlan will be created
  + resource "netbox_ipam_vlan" "vlan" {
      + content_type = (known after apply)
      + id           = (known after apply)
      + name         = "git_net_1"
      + status       = "active"
      + vlan_id      = 15
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tfplan"

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*